# for using bundle / Brewfile
tap "homebrew/bundle"
# enable cask
tap "homebrew/cask"
# enable alternative versions
tap "homebrew/cask-versions"
# enable cask fonts
tap "homebrew/cask-fonts"

# zsh shell
brew "zsh"

# GNU utils - note: I don't want to override system binaries, so just skip with-default-names option.
brew "gnu-sed"
brew "gnu-tar"
brew "gnutls"
brew "grep"
brew "coreutils"
brew "binutils"
brew "diffutils"

# tmux
brew "tmux"

# system utils
brew "gzip"
brew "watch"
brew "wget"
brew "curl"
brew "nmap"
brew "htop"
brew "gpg"
brew "git"
brew "openssl"

# Vim
brew "vim"

# Hugo for blog
brew "hugo"

# casks for macos utility
cask "iterm2"
cask "google-chrome"

# Development Tools
cask "visual-studio-code"
cask "firefox-developer-edition"
cask "postman"
cask "sourcetree"
cask "docker"
cask "graphql-playground"

# Jetbrains Toolbox
cask "jetbrains-toolbox"

# Productivity
cask "slack"
cask "notion"

# For Homebrew Cask-fonts Install
brew "svn"

# Fonts
cask "homebrew/cask-fonts/font-nanum-gothic"
cask "homebrew/cask-fonts/font-nanum-gothic-coding"
cask "homebrew/cask-fonts/font-d2coding"
cask "homebrew/cask-fonts/font-noto-sans-cjk"
cask "homebrew/cask-fonts/font-awesome-terminal-fonts"

# Common
brew "asdf"

# Database
brew "mysql"
brew "postgresql"

# AWS
brew "awscli"
brew "awslogs"

# Ruby
brew "rbenv"
brew "ruby-build"

# Node
brew "nvm"

# Java
# brew "jenv"

# Python
# brew "pyenv"
# brew "pyenv-virtualenv"
# brew "pipenv"
